"ALL_DAY_DAY_VIEW" = "koko pv";
"NOON" = "12.00";
"UNTITLED_EVENT" = "Uusi tapahtuma";
"ALL_DAY" = "koko päivä";
"ALL_DAY_EVENTS" = "kokopäiväiset tapahtumat";
"CELL_ENDS" = "PÄÄTTYY";

"CALENDARS" = "Kalenterit";

"ALL" = "Kaikki";
"ALL_CALENDARS" = "Kaikki kalenterit";
"ALL_OF_STORE" = "Kaikki (%@)";
"N_CALENDARS" = "%@ kalenteria";

"SHOW_CALENDARS" = "Näytä kalenterit";
"SHOW_ALL_CALENDARS" = "Näytä kaikki kalenterit";
"HIDE_ALL_CALENDARS" = "Kätke kaikki kalenterit";
"NO_CALENDARS" = "Ei kalentereita";

"ALERT" = "Hälytys";
"ALERT_LOWERCASE" = "hälytys";
"ALERT_DETAIL_NAV_TITLE" = "Hälytys";
"SECOND_ALERT" = "2. hälytys";
"NONE_ALERT" = "Ei";
"NONE_INVITEES" = "Ei";
"EVENT" = "Tapahtuma";
"EVENTS" = "Tapahtumat";

"INTERVAL_SEPARATOR" = ", ";
"INTERVAL_DAYS" = "%@ päivää";
"INTERVAL_DAY" = "1 päivä";
"INTERVAL_HOURS" = "%@ tuntia";
"INTERVAL_HOUR" = "1 tunti";
"INTERVAL_MINUTES" = "%@ minuuttia";
"INTERVAL_MINUTE" = "1 minuutti";
"INTERVAL_SECONDS" = "%@ sekuntia";
"INTERVAL_SECOND" = "1 sekunti";
"INTERVAL_WEEK" = "1 viikko";
"INTERVAL_FORMAT_BEFORE" = "%@ ennen";
"INTERVAL_FORMAT_AFTER" = "%@ myöhemmin";
"BEFORE" = " ennen";
"AFTER" = " myöhemmin";
"ON_TIME" = "Tapahtuma-aikana";
"ON_TIME_AT" = "Samana päivänä (%@)";
"ALL_DAY_ALARM_FORMAT" = "%@ (%@)";


"DAY_TO_BETWEEN_TIMES" = " - ";
"DAY_TO_NO_START_OR_LINE_BEGINNING" = " - ";

"DAY_HEADER_WEEKDAY_WITH_DATE_MONTH_YEAR_FORMAT" = "%1$@ %2$@";

"DETAIL_ALL_DAY" = "Koko päivä";

"DETAIL_DURATION_FORMAT" = "%@ - %@";
"DETAIL_MULTIPLE_DAYS_START_FORMAT" = "%@ %@";
"DETAIL_DURATION_FORMAT_NO_FROM" = "%@ - %@";
"DETAIL_MULTIPLE_DAYS_END_FORMAT" = "- %@ %@";
"DETAIL_MULTIPLE_ALL_DAY_START_FORMAT" = "Kokopäiväisesti %@";
"DETAIL_MULTIPLE_ALL_DAY_END_FORMAT" = "- %@";

"CALENDAR" = "Kalenteri";
"UNTITLED_CALENDAR" = "Nimetön kalenteri";
"UNTITLED_ACCOUNT" = "Nimetön tili";

"NOTES_PLACEHOLDER" = "Huomautukset";
"NOTES_LOWERCASE" = "huomautus";
"NOTES" = "Huomautukset";
"SHOW_ALL_NOTES" = "Näytä kaikki huomautukset";

"URL" = "Verkko-osoite";
"URL_LOWERCASE" = "osoite";

"VIEW_ON_FACEBOOK" = "Näytä Facebookissa";

"UNKNOWN" = "Tuntematon";

"SHARED_CALENDAR" = "Jaettu kalenteri";
"SHARED" = "Jaettu";
"SHARED_BY_WITH_OWNER_DESCRIPTION" = "Jakaja: %@";
"SHARED_WITH_SINGLE_PERSON" = "Jaettu: %@";
"SHARED_WITH_MULTIPLE_PEOPLE" = "Jaettu: %@ ja…";
"PUBLIC_AND_SHARED" = "Julkinen ja jaettu henkilöiden %@ kanssa…";

"ACCESS_DENIED_EVENTS" = "Tällä ohjelmalla ei ole lupaa käyttää kalentereitasi.";
"ACCESS_DENIED_REMINDERS" = "Tällä ohjelmalla ei ole lupaa käyttää muistutuksiasi.";

/* Name of subscribed group */
"SUBSCRIBED" = "Tilattu";
/* Name of birthday calendar */
"BIRTHDAY_CALENDAR" = "Syntymäpäivät";
/* The 'other' account, where the birthday calendar lives */
"OTHER_ACCOUNT" = "Muut";

/* Name of default Reminders calendar (9806767) */
"REMINDERS_CALENDAR" = "Muistutukset";

/* Names of default iCloud calendars */
"ICLOUD_HOME_CALENDAR" = "Koti";
"ICLOUD_WORK_CALENDAR" = "Työ";

"STARTS" = "Alkaa";
"ENDS" = "Päättyy";

"REPEAT" = "Toista";
"NEVER" = "Ei koskaan";
"DAILY" = "Päivittäin";
"WEEKLY" = "Viikoittain";
"BIWEEKLY" = "Joka toinen viikko";
"MONTHLY" = "Kuukausittain";
"YEARLY" = "Vuosittain";
"CUSTOM" = "Muokattu";

"AVAILABILITY" = "Saatavuus";
"BUSY" = "Varattu";
"FREE" = "Vapaa";
"TENTATIVE" = "Alustavasti";
"OUT_OF_OFFICE" = "Ei töissä";

"EDIT" = "Muokkaa";
"CANCEL" = "Kumoa";
"DONE" = "Valmis";
"ADD" = "Lisää";
"TO_WITH_COLON" = "Vast.ott.:";

/* ICS preview controller strings */

/* titles */
"ICS_EVENT_DETAILS" = "Tapahtuma";
"ICS_EVENTS" = "%@ tapahtumaa";

/* button title */
"ICS_ADD_ALL" = "Lisää kaikki";
"ICS_ADD_SOME" = "Lisää (%@)";

/* calendar chooser title */
"ICS_CHOOSE_CALENDAR" = "Valitse kalenteri";

"DELETE_CALENDAR" = "Poista kalenteri";
"EDIT_CALENDAR" = "Kalenteri";
"EDIT_CALENDARS" = "Kalenterit";
"ADD_CALENDAR" = "Lisää kalenteri";
"JOIN_CALENDAR" = "Liity kalenteriin";
"CALENDAR_NAME" = "Kalenterin nimi";
"NEW_CALENDAR_WITH_ELLIPSIS" = "Uusi kalenteri…";
"ADD_CALENDAR_WITH_ELLIPSIS" = "Lisää kalenteri…";
"DELETE_CALENDAR_CONFIRMATION" = "Haluatko varmasti poistaa tämän kalenterin? Kaikki tähän kalenteriin liitetyt tapahtumat ja muistutukset poistetaan myös.";
"DELETE_CALENDAR_CONFIRMATION_EVENTS_ONLY" = "Haluatko varmasti poistaa tämän kalenterin? Kaikki tähän kalenteriin liitetyt tapahtumat poistetaan myös.";
"DELETE_CALENDAR_CONFIRMATION_REMINDERS_ONLY" = "Haluatko varmasti poistaa tämän kalenterin? Kaikki tähän kalenteriin liitetyt muistutukset poistetaan myös.";

"UNKNOWN_IDENTITY" = "joku";
"UNKNOWN_IDENTITY_CAPITALIZED" = "Joku";

"JOIN_CALENDAR_TITLE_FORMAT" = "Haluatko liittyä kalenteriin %@?";
"JOIN_CALENDAR_BODY_FORMAT" = "%@ kutsui sinut jaettuun kalenteriin.";

"CANCELELD_BY_FORMAT" = "%@ perui";
"FROM_FORMAT" = "Lähettäjä: %@";
"TIME_CHANGED_TO_FORMAT" = "Ajaksi muutettiin %@";
"DATE_CHANGED_TO_FORMAT" = "Ajaksi muutettiin %@";
"LOCATION_CHANGED" = "Paikka muuttui";

"QUOTED_FORMAT" = "”%@”";

"COLOR" = "Väri";
"PURPLE" = "Violetti";
"ORANGE" = "Oranssi";
"BLUE" = "Sininen";
"RED" = "Punainen";
"BROWN" = "Ruskea";
"YELLOW" = "Keltainen";
"GREEN" = "Vihreä";

"SHARED_WITH_COLON" = "Jaettu:";
"PENDING" = "Odotetaan";
"OWNER" = "Omistaja";
"ADD_PERSON" = "Lisää henkilö";
"ADD_PERSON_WITH_ELLIPSIS" = "Lisää henkilö…";
"PUBLIC_CALENDAR" = "Julkinen kalenteri";
"PUBLIC_CALENDAR_DESCRIPTION" = "Salli kenen tahansa tilata lukuoikeus tähän kalenteriin.";
"PUBLISHING_WITH_ELLIPSIS" = "Julkaistaan…";
"VIEW_ONLY" = "Katso";
"VIEW_AND_EDIT" = "Katso ja muokkaa";
"ALLOW_EDITING" = "Salli muokkaus";
"ALLOW_EDITING_DESCRIPTION" = "Salli tämän henkilön tehdä muutoksia\nkalenteriin.";
"RESEND_SHARING_INVITATION" = "Lähetä jakokutsu uudelleen";
"REMOVE_FROM_CALENDAR" = "Poista kalenterista";
"REMOVE" = "Poista";
"REMOVE_ALERT_TEXT" = "%@ menettää välittömästi käyttöoikeuden tähän kalenteriin.";
"SHARE_LINK_WITH_ELLIPSIS" = "Jaa linkki…";
"SHARE_LINK_TO_CALENDAR_WITH" = "Jaa kalenterin linkki:";
"EMAIL" = "Sähköposti";
"MESSAGE" = "Viesti";
"TWEET" = "Twiitti";
"COPY_LINK" = "Kopioi linkki";

/* Shared calendar event changes */
"SHARED_ADDED_TO_CALENDAR_BY" = "%2$@ lisäsi kalenteriin %1$@";
"SHARED_DELETED_FROM_CALENDAR_BY" = "%2$@ poisti kalenterista %1$@";
"SHARED_UPDATED_IN_CALENDAR_BY" = "%2$@ päivitti kalenteria %1$@";
"SHARED_ONE_PROP_CHANGED_BY" = "%@ muutettiin (%@)";
"SHARED_ONE_PROP_CHANGED_TO_BY" = "Muutos: %@ > %@ (%@)";
"SHARED_TWO_PROPS_CHANGED_BY" = "%@ ja %@ muutettiin (%@)";

"SHARED_ADDED_TO_CALENDAR_COALESCED" = "%@ tapahtumaa lisättiin kalenteriin %@.";
"SHARED_DELETED_FROM_CALENDAR_COALESCED" = "%@ tapahtumaa poistettiin kalenterista %@.";
"SHARED_UPDATED_IN_CALENDAR_COALESCED" = "%@ tapahtumaa päivitettiin kalenterissa %@.";
"SHARED_ADDED_TO_CALENDAR_BY_COALESCED" = "%3$@ lisäsi %1$@ tapahtumaa kalenteriin %2$@.";
"SHARED_DELETED_FROM_CALENDAR_BY_COALESCED" = "%3$@ poisti %1$@ tapahtumaa kalenterista %2$@.";
"SHARED_UPDATED_IN_CALENDAR_BY_COALESCED" = "%3$@ päivitti %1$@ tapahtumaa kalenterissa %2$@.";

"SHARED_PROP_DATE" = "päivä";
"SHARED_PROP_TIME" = "aika";
"SHARED_PROP_TITLE" = "nimi";
"SHARED_PROP_LOCATION" = "sijainti";

"ADD_SHAREES_PROMPT" = "Lisää kalenteriin osallistujia.";

"CREATED_BY" = "Luonut";
"EDITED_BY" = "Muokannut";
"CREATED_BY_LOWERCASE" = "luonut";
"EDITED_BY_LOWERCASE" = "muokannut";

"SHARED_CALENDAR_INVITE_REPLY_ACCEPTED" = "%@ liittyi jaettuun kalenteriisi.";
"SHARED_CALENDAR_INVITE_REPLY_DECLINED" = "%@ kieltäytyi jaetusta kalenteristasi.";
"PENDING_SHARED_CALENDAR_FORMAT" = "%@ ei ole vielä vastannut tähän jaettuun kalenterikutsuun.";

"SHARED_CALENDAR_NO_LONGER_SHARED" = "Tätä kalenteria ei enää jaeta.";
"SHARED_CALENDAR_NOW_PUBLIC" = "Tämä kalenteri on nyt julkinen.";

"PUBLISHED_CALENDAR_MESSAGE_SUBJECT" = "Tilaa %@-kalenterini";
"PUBLISHED_CALENDAR_MESSAGE_BODY" = "Tilaa %@-kalenterini osoitteessa %@";

"ATTACHMENTS" = "Liitteet";
"ATTACHMENTS_LOWERCASE" = "liitteet";
"CANNOT_OPEN_ATTACHMENT" = "Liitettä ei voida avata";
"ATTACHMENT_DOWNLOAD_PROGRESS" = "%@ / %@";
"ATTACHMENT_DOWNLOAD_ERROR" = "Liitettä ladattaessa tapahtui virhe.";
"ATTACHMENT_FILE_TYPE_ERROR" = "Tiedoston tyyppiä ei tueta.";
"UNTITLED_ATTACHMENT" = "Nimetön liite";

"UPDATING_CALENDARS_WITH_ELLIPSIS" = "Päivitetään kalentereita…";

"ENDS_TIME_FORMAT" = "päättyy %@";

"CALENDAR_DATE_AT_TIME_FORMAT" = "%@ klo %@";
"CALENDAR_TODAY" = "Tänään";
"CALENDAR_TODAY_LOWER" = "tänään";
"CALENDAR_YESTERDAY" = "Eilen";
"CALENDAR_YESTERDAY_LOWER" = "eilen";
"CALENDAR_TOMORROW" = "Huomenna";
"CALENDAR_TOMORROW_LOWER" = "huomenna";

/* date prior to day, but in previous week ('last Monday')*/
"CALENDAR_LAST_WEEK_FORMAT" = "Viime %@";
"CALENDAR_LAST_WEEK_LOWER_FORMAT" = "viime %@";
/* prior day to today, but in this week ('this past Monday') */
"CALENDAR_PRIOR_DAY_THIS_WEEK_FORMAT" = "Viime %@";
"CALENDAR_PRIOR_DAY_THIS_WEEK_LOWER_FORMAT" = "viime %@";
/* date after today, but in this week ('this Friday') */
"CALENDAR_SUBSEQUENT_DAY_THIS_WEEK_FORMAT" = "Ensi %@";
"CALENDAR_SUBSEQUENT_DAY_THIS_WEEK_LOWER_FORMAT" = "ensi %@";
/* date after today, but in next week ('next Thursday'). I'm not completely sure why we don't just say Next here. */
"CALENDAR_NEXT_WEEK_FORMAT" = "Ensi %@";
"CALENDAR_NEXT_WEEK_LOWER_FORMAT" = "ensi %@";

/* These strings are used for the title of a group of accounts of specific types */
"SUBSCRIBED_CALENDAR_GROUP_TITLE" = "Tilattu";
/* Ususally preceeded by "All" to denote selecting all the calendars in the group. In english these are the same. */
"SUBSCRIBED_CALENDAR_GROUP_MID_SENTENCE_TITLE" = "Tilattu";

"FACEBOOK_GROUP_TITLE" = "Facebook";
"FACEBOOK_GROUP_MID_SENTENCE_TITLE" = "Facebook";
